"use strict"
//to add quotes
//([^,]*)(,|$) find
//"$1"$2 replace
let CITIESLIST = `{ 
    "А" : {
        "Абингдон" : 0,
        "Амстердам" : 0,
        "Антверпен" : 0,
        "Архангельск" : 0,
        "Астрахань" : 0,
        "Атланта" : 0,
        "Афины" : 0
    },
    "Б" : {
        "Баден" : 0,
        "Базель": 0,
        "Бангалор" : 0,
        "Барселона" : 0,
        "Бендеры" : 0,
        "Берлин" : 0,
        "Берн" : 0,
        "Биробиджан" : 0,
        "Бонн" : 0,
        "Бостон" : 0,
        "Брайзах-на-Рейне" : 0,
        "Бремен" : 0,
        "Будённовск" : 0,
        "Буффало" : 0,
        "Буэнос-Айрес" : 0
    },
    "В" : {
        "Варшава" : 0,
        "Вашингтон" : 0,
        "Веймар" : 0,
        "Вельс" : 0,
        "Вельск" : 0,
        "Вена" : 0,
        "Венеция" : 0,
        "Винница" : 0,
        "Владивосток" : 0,
        "Волгоград" : 0,
        "Вологда" : 0,
        "Вормс" : 0,
        "Воронеж" : 0
    },
    "Г" : {
        "Гамбург" : 0,
        "Ганновер" : 0,
        "Гданьск" : 0,
        "Гродно" : 0
    },
    "Д" : {
        "Делфт" : 0,
        "Денвер" : 0,
        "Детройт" : 0,
        "Донецк" : 0,
        "Дорчестер" : 0,
        "Дрезден" : 0,
        "Дублин" : 0,
        "Дувр" : 0,
        "Дуйсбург" : 0
    },
    "Е" : {
        "Екатеринбург" : 0
    },	
    "Ё" : {
        
    },
    "Ж" : {
        "Женева" : 0
    },	
    "З" : {
        "Зойцбург" : 0
    }, 	
    "И" : {
        "Иваново" : 0,
        "Иерусалим" : 0,
        "Измаил" : 0,
        "Ингельхайм-ам-Райн" : 0,
        "Иркутск" : 0
    }, 	
    "Й" : {
        "Йоркшир" : 0
    }, 	
    "К" : {
        "Казань" : 0,
        "Калгари" : 0,
        "Кале" : 0,
        "Калининград" : 0,
        "Калуга" : 0,
        "Караганда" : 0,
        "Каргополь" : 0,
        "Карлсруэ" : 0,
        "Кашин" : 0,
        "Кёльн" : 0,
        "Киев" : 0,
        "Киншаса" : 0,
        "Кишинёв" : 0,
        "Клайпеда" : 0,
        "Кола" : 0,
        "Копенгаген" : 0,
        "Коряжма" : 0,
        "Котлас" : 0,
        "Котор" : 0,
        "Краков" : 0,
        "Красноярск" : 0,
        "Кызыл" : 0
    }, 	
    "Л" : {
        "Лан" : 0,
        "Лейпциг" : 0,
        "Лион" : 0,
        "Липецк" : 0,
        "Лозанна" : 0,
        "Лондон" : 0,
        "Лос-Анджелес" : 0,
        "Луга" : 0,
        "Львов" : 0,
        "Льеж" : 0,
        "Люйшунькоу" : 0
    }, 	
    "М" : {
        "Мадрид" : 0,
        "Мальборк" : 0,
        "Мамоново" : 0,
        "Мангейм" : 0,
        "Марсель" : 0,
        "Матера" : 0,
        "Мезень" : 0,
        "Мейсен" : 0,
        "Милан" : 0,
        "Минусинск" : 0,
        "Мирный" : 0,
        "Монреаль" : 0,
        "Мурманск" : 0,
        "Мюнхен" : 0
        
    }, 
    "Н" : {
        "Назарет" : 0,
        "Нарьян-Мар" : 0,
        "Нахалаль" : 0,
        "Неаполь" : 0,
        "Николаевск-на-Амуре" : 0,
        "Ницца" : 0,
        "Новгород" : 0,
        "Новосибирск" : 0,
        "Новый Орлеан" : 0,
        "Нью-Йорк" : 0,
        "Нюрнберг" : 0
    }, 	
    "О" : {
        "Омск" : 0,
        "Оренбург" : 0,
        "Оттава" : 0
    }, 	
    "П" : {
        "Павия" : 0,
        "Париж" : 0,
        "Пермь" : 0,
        "Пиза" : 0,
        "Подгайцы" : 0,
        "Полтава" : 0,
        "Порт-Артур" : 0,
        "Пошехонье" : 0,
        "Прага" : 0,
        "Псков" : 0,
        "Пушкино" : 0
    }, 	
    "Р" : {
        "Рединг" : 0,
        "Реймс" : 0,
        "Рига" : 0,
        "Рим" : 0,
        "Рио-де-Жанейро" : 0,
        "Ростов-на-Дону" : 0,
        "Руан" : 0,
        "Рязань" : 0
    }, 	
    "С" : {
        "Салоники" : 0,
        "Самара" : 0,
        "Сан-Франциско" : 0,
        "Сараево" : 0,
        "Сарапул" : 0,
        "Северодвинск" : 0,
        "Сиэтл" : 0,
        "Советск" : 0,
        "Сорренто" : 0,
        "Сочи" : 0,
        "Стамбул" : 0,
        "Страсбург" : 0
    }, 	
    "Т" : {
        "Таганрог" : 0,
        "Тверь" : 0,
        "Тегеран" : 0,
        "Тель-Авив" : 0,
        "Тобольск" : 0,
        "Томск" : 0,
        "Торонто" : 0,
        "Трир" : 0,
        "Тулча" : 0,
        "Тюмень" : 0
    }, 	
    "У" : {
        "Уфа" : 0
    }, 
    "Ф" : {
        "Фаниполь" : 0,
        "Фонтенбло" : 0
    }, 	
    "Х" : {
        "Хабаровск" : 0,
        "Ханты-Мансийск" : 0,
        "Харьков" : 0,
        "Хельсинки" : 0,
        "Химки" : 0,
        "Холмогоры" : 0,
        "Хьюстон" : 0
    }, 	
    "Ц" : {
        "Цюрих" : 0
    }, 	
    "Ч" : {
        "Чернигов" : 0,
        "Чикаго" : 0
    }, 	
    "Ш" : {
        "Шаффхаузен" : 0
    }, 	
    "Щ" : {
        "Щучин" : 0
    }, 	
    "Ъ" : {
        
    }, 
    "Ы" : {
        
    }, 	
    "Ь" : {
        
    }, 	
    "Э" : {
        "Эрфурт" : 0
    }, 	
    "Ю" : {
        "Ювяскюля" : 0,
        "Юджин" : 0,
        "Южа" : 0,
        "Юрга" : 0,
        "Юрмала" : 0,
        "Юрьевец" : 0,
        "Юрюзань" : 0,
        "Юхнов" : 0
    }, 	
    "Я" : {
        "Ялуторовск" : 0
    }

}`
